In [1]:
#Database and Database connectivity
import sqlite3
#connecting with the database (if there is no database exists, it will creat one)
db =sqlite3.connect('my_first_db.db')

In [4]:
db1 = sqlite3.connect('C:/Users/Lenovo/Desktop/Data Trained/DB folder/demo.db')          #defferent path

In [5]:
#declare cursor
cursor = db.cursor()

In [9]:
#create table
cursor.execute("CREATE TABLE score1(gender Text, student_id INT PRIMARY KEY, marks INT)")

OperationalError: table score1 already exists

In [2]:
#insert record in table
cursor.execute("INSERT INTO score1(gender,student_id,marks) values('Male',003,100)")

#save the records permanently. (if you dont commit, next time you will not see the records in the  table)
db.commit()

#Count of records inseted
print(cursor.rowcount,'Record(s) inserted')

NameError: name 'cursor' is not defined

In [3]:
#insert record in table
cursor.execute("INSERT INTO score1(gender,student_id,marks) values('Male',004,100)")

#save permanently.
db.commit()

NameError: name 'cursor' is not defined

In [4]:
import sqlite3
db = sqlite3.connect('FirstDatabse.db')

In [5]:
cursor = db.cursor()

In [6]:
cursor.execute("CREATE TABLE score2(gender Text, student_id INT PRIMARY KEY, marks INT)")

In [7]:
#insert record in table
cursor.execute("INSERT INTO score2(gender,student_id,marks) values('Male',001,100)")

#save the records permanently. (if you dont commit, next time you will not see the records in the  table)
db.commit()

#Count of records inseted
print(cursor.rowcount,'Record(s) inserted')

1 Record(s) inserted

In [24]:
#how to fetch the tabel data
result = cursor.execute("SELECT * FROM score2")
for row in result:
    print(row)
print(row.count)

('Male', 1, 100)
('Male', 2, 100)
('Male', 3, 100)
('Male', 4, 100)
('Female', 5, 100)
('Female', 6, 100)
('Female', 7, 100)
('Male', 8, 100)
('Female', 9, 200)
('Male', 10, 100)
('Female', 11, 200)
('Male', 12, 100)
('Female', 13, 300)
('Male', 14, 200)
('Female', 15, 520)
('Male', 16, 100)
('Female', 17, 100)
('Male', 18, 200)
('Female', 19, 300)
('Male', 20, 400)
<built-in method count of tuple object at 0x0000017EE26B7C40>

In [12]:
cursor.execute("INSERT INTO score2(gender,student_id,marks) values('Male',004,100)")

#save the records permanently. (if you dont commit, next time you will not see the records in the  table)
db.commit()

In [14]:
#multiple record insertion
cursor.execute("INSERT INTO score2(gender,student_id,marks) VALUES('Female',005,100),('Female',006,100),('Female',007,100)")
db.commit()

In [17]:
#inserting records from file (CSV)
with open("C:/Users/Lenovo/Desktop/Data Trained/score_file.csv","r") as file:
    no_record =0
    for row in file:
        cursor.execute("INSERT INTO score2 values(?,?,?)",row.split(","))
        db.commit()
        no_record +=1
#db.close()
print(no_record,' Records inserted')

13  Records inserted

In [2]:
#how to fetch the tabel data
result1 = cursor.execute("SELECT * FROM score2")
for row in result1:
    print(row)

NameError: name 'cursor' is not defined

In [3]:
cursor = db.cursor()

NameError: name 'db' is not defined

In [4]:
import sqlite3
db = sqlite3.connect('FirstDatabse.db')

In [5]:
cursor = db.cursor()

In [6]:
#how to fetch the tabel data
result1 = cursor.execute("SELECT * FROM score2")
for row in result1:
    print(row)

('Male', 1, 100)
('Male', 2, 100)
('Male', 3, 100)
('Male', 4, 100)
('Female', 5, 100)
('Female', 6, 100)
('Female', 7, 100)
('Male', 8, 100)
('Female', 9, 200)
('Male', 10, 100)
('Female', 11, 200)
('Male', 12, 100)
('Female', 13, 300)
('Male', 14, 200)
('Female', 15, 520)
('Male', 16, 100)
('Female', 17, 100)
('Male', 18, 200)
('Female', 19, 300)
('Male', 20, 400)

In [9]:
#Where clause: select records based on condition
sp1 = "SELECT * FROM score2 WHERE student_id = 4"
result = cursor.execute(sp1)
for row in result:
    print(row)

('Male', 4, 100)

In [10]:
#delete the data
sq1 = "DELETE FROM score2 WHERE student_id=4"
db.commit()
cursor.execute(sq1)

In [11]:
result = cursor.execute("SELECT * FROM score2")
for row in result:
    print(row)

('Male', 1, 100)
('Male', 2, 100)
('Male', 3, 100)
('Female', 5, 100)
('Female', 6, 100)
('Female', 7, 100)
('Male', 8, 100)
('Female', 9, 200)
('Male', 10, 100)
('Female', 11, 200)
('Male', 12, 100)
('Female', 13, 300)
('Male', 14, 200)
('Female', 15, 520)
('Male', 16, 100)
('Female', 17, 100)
('Male', 18, 200)
('Female', 19, 300)
('Male', 20, 400)

In [16]:
#data get in descreging order useing order by
result2 = cursor.execute("SELECT * FROM score2 ORDER BY marks desc")
for row in result2:
    print(row)

('Female', 15, 520)
('Male', 20, 400)
('Female', 13, 300)
('Female', 19, 300)
('Female', 9, 200)
('Female', 11, 200)
('Male', 14, 200)
('Male', 18, 200)
('Male', 1, 100)
('Male', 2, 100)
('Male', 3, 100)
('Female', 5, 100)
('Female', 6, 100)
('Female', 7, 100)
('Male', 10, 100)
('Male', 12, 100)
('Male', 16, 100)
('Female', 17, 100)
('Male', 8, 50)

In [15]:
# update the table
# single record update
sq2= "UPDATE SCORE2 SET marks = 50 WHERE student_id = 8"
cursor.execute(sq2)

In [17]:
#multilpe data update
sq3 ="UPDATE score2 SET marks =35 WHERE student_id IN (5,12)"
cursor.execute(sq3)

In [20]:
rs= cursor.execute("SELECT * FROM score2 ORDER BY marks desc")
for row in rs:
    print(row)

('Female', 15, 520)
('Male', 20, 400)
('Female', 13, 300)
('Female', 19, 300)
('Female', 9, 200)
('Female', 11, 200)
('Male', 14, 200)
('Male', 18, 200)
('Male', 1, 100)
('Male', 2, 100)
('Male', 3, 100)
('Female', 6, 100)
('Female', 7, 100)
('Male', 10, 100)
('Male', 16, 100)
('Female', 17, 100)
('Male', 8, 50)
('Female', 5, 35)
('Male', 12, 35)

In [23]:
# update records using between 
sq4 = "UPDATE score2 SET marks=150 WHERE student_id BETWEEN 8 AND 10"
cursor.execute(sq4)

#verify the result
rs1 = cursor.execute("SELECT * FROM score2 ORDER BY marks desc")
for row in rs1:
    print(row)

('Female', 15, 520)
('Male', 20, 400)
('Female', 13, 300)
('Female', 19, 300)
('Female', 11, 200)
('Male', 14, 200)
('Male', 18, 200)
('Male', 8, 150)
('Female', 9, 150)
('Male', 10, 150)
('Male', 1, 100)
('Male', 2, 100)
('Male', 3, 100)
('Female', 6, 100)
('Female', 7, 100)
('Male', 16, 100)
('Female', 17, 100)
('Female', 5, 35)
('Male', 12, 35)

In [24]:
# MIN function for minimum value get
RS =  cursor.execute("SELECT MIN(marks) FROM score2")
for row in RS:
    print(row)

(35,)

In [25]:
# MAX function use for maximun value
RS1 = cursor.execute("SELECT MAX(marks) FROM score2")
for row in RS1:
    print(row)

(520,)

In [27]:
#min function with fetchone
res = cursor.execute("SELECT MIN(marks) FROM score2")
print('Minimum Marks = ', res.fetchall())

# Max function
res = cursor.execute("SELECT MAX(marks) FROM score2")
print('Maximum Marks = ', res.fetchone())

Minimum Marks =  [(35,)]
Maximum Marks =  (520,)

In [21]:
import sqlite3
db = sqlite3.connect('FirstDatabse.db')
cursor = db.cursor()

In [2]:
db = sqlite3.connect("student_curse_database.db")

In [3]:
cur = db.cursor()

In [4]:
cur.execute("create table course1(courseid int primary key, cursename text, duration int)")

In [7]:
cur.execute("create table student1(roll_no int primary key, studentname text, age int,courseid int, foreign key(courseid) references course1(course1))")

In [8]:
cur.execute("insert into course1 values(78,'Data science',12),(56,'Python course',4),(101,'Database',7)")
print(cur.rowcount, "record(s) inserted")
db.commit;

3 record(s) inserted

In [9]:
cur.execute("insert into student1 values(1,'yogesh',30,78),(2,'Tara',25,56),(3,'Ravi',26,56),(4,'Rashi',2,78)")
print(cur.rowcount,"record(s) iinserted")
db.commit;

4 record(s) iinserted

In [11]:
result = cur.execute("select * from course1")
result.fetchall()

[(78, 'Data science', 12), (56, 'Python course', 4), (101, 'Database', 7)]

In [12]:
res = cur.execute("select * from student1")
res.fetchall()

[(1, 'yogesh', 30, 78),
 (2, 'Tara', 25, 56),
 (3, 'Ravi', 26, 56),
 (4, 'Rashi', 2, 78)]

In [16]:
results = cur.execute('select courseid from course1 where cursename= "Data science"')
for i in results:
    print(i)

(78,)

In [17]:
results = cur.execute('select *from student1 where courseid = (select courseid from course1 where cursename = "Data science")')
results.fetchall()

[(1, 'yogesh', 30, 78), (4, 'Rashi', 2, 78)]

In [18]:
results = cur.execute('select *from student1 where courseid = (select courseid from course1 where cursename = "Python course")')
results.fetchall()

[(2, 'Tara', 25, 56), (3, 'Ravi', 26, 56)]

In [19]:
#join
# Different type of SQL joins
# (INNER) join: returns all records that have matching values in both table
# LEFT (OUTER) join : Returns all records from the left table, and the matched records from the right table
# Right (Outer) Join : Returns all records from the right table, aand the matched records from the left table
# full (outer) join : Returns  all the records when there is a match in either left or right table

In [20]:
#crate one more table
cur.execute("create table students(student_name text, student_id int primary key,phone_number int)")
cur.execute("insert  into students values('yogesh',101,8945454545),('ravi',102,2525252525)")
db.commit;

#verify if rocres inserted
result = cur.execute("select*from students")

print('Name stud_ID phone_num    \n=====================')
for row in result:
    print(row)

Name stud_ID phone_num
=====================
('yogesh', 101, 8945454545)
('ravi', 102, 2525252525)

In [28]:
#crate one more table
#cursor.execute("create table students(student_name text, student_id int primary key,phone_number int)")
cursor.execute("insert  into students values('yogesh',1,8945454545),('ravi',1,2525252525)")
db.commit;

#verify if rocres inserted
result = cursor.execute("select*from students")

print('Name stud_ID phone_num    \n=====================')
for row in result:
    print(row)

IntegrityError: UNIQUE constraint failed: students.student_id

In [26]:
results = cursor.execute("SELECT * FROM score2")
for row in results:
    print(row)

('Male', 1, 100)
('Male', 2, 100)
('Male', 3, 100)
('Male', 4, 100)
('Female', 5, 100)
('Female', 6, 100)
('Female', 7, 100)
('Male', 8, 100)
('Female', 9, 200)
('Male', 10, 100)
('Female', 11, 200)
('Male', 12, 100)
('Female', 13, 300)
('Male', 14, 200)
('Female', 15, 520)
('Male', 16, 100)
('Female', 17, 100)
('Male', 18, 200)
('Female', 19, 300)
('Male', 20, 400)

In [33]:
#inner join
sq1 = 'select students.student_id,students.student_name,score2.gender,score2.marks from score2 inner join students on students.student_id= score2.student_id'
result = cursor.execute(sq1)
for row in result:
    print(row)

(1, 'yogesh', 'Male', 100)
(2, 'ravi', 'Male', 100)

In [32]:
cursor.execute("insert  into students values('yogesh',1,8945454545),('ravi',2,2525252525)")
db.commit;

#verify if rocres inserted
result = cursor.execute("select*from students")

print('Name stud_ID phone_num    \n=====================')
for row in result:
    print(row)

Name stud_ID phone_num
=====================
('yogesh', 101, 8945454545)
('ravi', 102, 2525252525)
('yogesh', 1, 8945454545)
('ravi', 2, 2525252525)

In [34]:
#Left join
sq1 = 'select students.student_id,students.student_name,score2.gender,score2.marks from score2 left join students on students.student_id= score2.student_id'
result = cursor.execute(sq1)
for row in result:
    print(row)

(1, 'yogesh', 'Male', 100)
(2, 'ravi', 'Male', 100)
(None, None, 'Male', 100)
(None, None, 'Male', 100)
(None, None, 'Female', 100)
(None, None, 'Female', 100)
(None, None, 'Female', 100)
(None, None, 'Male', 100)
(None, None, 'Female', 200)
(None, None, 'Male', 100)
(None, None, 'Female', 200)
(None, None, 'Male', 100)
(None, None, 'Female', 300)
(None, None, 'Male', 200)
(None, None, 'Female', 520)
(None, None, 'Male', 100)
(None, None, 'Female', 100)
(None, None, 'Male', 200)
(None, None, 'Female', 300)
(None, None, 'Male', 400)

In [36]:
#Drop Table : Delete table from SQL
sql = 'drop table score2'
cursor.execute(sql)

In [37]:
sql = 'drop table students'
cursor.execute(sql)

In [38]:
db.close()